Klipper3d/klipper/lib/asf/sam/utils/cmsis/sam4l/include/component/component_ast.h
#define AST_VERSION_VERSION_Pos     0            /**< \brief (AST_VERSION) Version Number */
#define AST_VERSION_VERSION_Msk     (0xFFFu << AST_VERSION_VERSION_Pos)
#define AST_VERSION_VERSION(value)  ((AST_VERSION_VERSION_Msk & ((value) << AST_VERSION_VERSION_Pos)))
#define AST_VERSION_VARIANT_Pos     16           /**< \brief (AST_VERSION) Variant Number */
#define AST_VERSION_VARIANT_Msk     (0xFu << AST_VERSION_VARIANT_Pos)
#define AST_VERSION_VARIANT(value)  ((AST_VERSION_VARIANT_Msk & ((value) << AST_VERSION_VARIANT_Pos)))
#define AST_VERSION_MASK            0x000F0FFFu  /**< \brief (AST_VERSION) MASK Register */

/** \brief AST hardware registers */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef struct {
  RwReg   AST_CR;             /**< \brief (AST Offset: 0x00) Control Register */
  RwReg   AST_CV;             /**< \brief (AST Offset: 0x04) Counter Value */
  RoReg   AST_SR;             /**< \brief (AST Offset: 0x08) Status Register */
  WoReg   AST_SCR;            /**< \brief (AST Offset: 0x0C) Status Clear Register */
  WoReg   AST_IER;            /**< \brief (AST Offset: 0x10) Interrupt Enable Register */
  WoReg   AST_IDR;            /**< \brief (AST Offset: 0x14) Interrupt Disable Register */
  RoReg   AST_IMR;            /**< \brief (AST Offset: 0x18) Interrupt Mask Register */
  RwReg   AST_WER;            /**< \brief (AST Offset: 0x1C) Wake Enable Register */
  RwReg   AST_AR0;            /**< \brief (AST Offset: 0x20) Alarm Register 0 */
  RwReg   AST_AR1;            /**< \brief (AST Offset: 0x24) Alarm Register 1 */
  RoReg8  Reserved1[0x8];
  RwReg   AST_PIR0;           /**< \brief (AST Offset: 0x30) Periodic Interval Register 0 */
  RwReg   AST_PIR1;           /**< \brief (AST Offset: 0x34) Periodic Interval Register 1 */
  RoReg8  Reserved2[0x8];
  RwReg   AST_CLOCK;          /**< \brief (AST Offset: 0x40) Clock Control Register */
  RwReg   AST_DTR;            /**< \brief (AST Offset: 0x44) Digital Tuner Register */
  WoReg   AST_EVE;            /**< \brief (AST Offset: 0x48) Event Enable Register */
  WoReg   AST_EVD;            /**< \brief (AST Offset: 0x4C) Event Disable Register */
  RoReg   AST_EVM;            /**< \brief (AST Offset: 0x50) Event Mask Register */
  RwReg   AST_CALV;           /**< \brief (AST Offset: 0x54) Calendar Value */
  RoReg8  Reserved3[0x98];
  RoReg   AST_PARAMETER;      /**< \brief (AST Offset: 0xF0) Parameter Register */
  RoReg8  Reserved4[0x8];
  RoReg   AST_VERSION;        /**< \brief (AST Offset: 0xFC) Version Register */
} Ast;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/*@}*/

#endif /* _SAM4L_AST_COMPONENT_ */
